Dlubal.RFEM5.IApplication
Interface for working with application

Dlubal.RFEM5.IApplication.LockLicense
Locks license.

Dlubal.RFEM5.IApplication.UnlockLicense
Unlocks license.

Dlubal.RFEM5.IApplication.IsComLicensed
Checks if COM is licensed.
Returns: Returns true if COM is licensed otherwise it returns false.

Dlubal.RFEM5.IApplication.IsAppLicensed
Checks if application is licensed.
Returns: Returns true if the application is licensed otherwise it returns false.

Dlubal.RFEM5.IApplication.CreateModel(System.String)
Creates model.
Returns: Model interface
Name: Name of the model.

Dlubal.RFEM5.IApplication.OpenModel(System.String)
Opens model.
Returns: Model interface
Path: Path to the model.

Dlubal.RFEM5.IApplication.GetModelCount
Counts opened models.
Returns: Number of opened models in the application

Dlubal.RFEM5.IApplication.GetModel(System.Int32)
Gets model at index.
Returns: Model interface
Index: Index of the model to be get.

Dlubal.RFEM5.IApplication.GetActiveModel
Gets interface to the active model.
Returns: While using with the running application, returns interface to the active model. While using with the hidden application, returns nothing.

Dlubal.RFEM5.IApplication.Show
Shows the hidden application.

Dlubal.RFEM5.IApplication.Close
Closes the application.

Dlubal.RFEM5.IApplication.RefreshGUI
Refreshes application GUI.

Dlubal.RFEM5.IApplication.GetVersion
Gets version of the application.
Returns: String containing version of the application.

Dlubal.RFEM5.IApplication.GetPath
Gets path to the application's folder.
Returns: Path to the application's folder.

Dlubal.RFEM5.IApplication.GetLanguage
Gets text identifier of the language currently used in the application.
Returns:
Text identifiers currently used in the application.
Available identifiers are listed in the following table:
IdentifierLanguage
ENUEnglish
DEUGerman
CSYCzech
ITAItalian
ESPSpanish
FRAFrench
PLKPolish
RUSRussian
PTGPortuguese

Dlubal.RFEM5.IApplication.SetLanguage(System.String)
Sets language to be used in the application.
Language:
Text identifier of the language to be set in the application.
Available identifiers are listed in the following table:
IdentifierLanguage
ENUEnglish
DEUGerman
CSYCzech
ITAItalian
ESPSpanish
FRAFrench
PLKPolish
RUSRussian
PTGPortuguese

Dlubal.RFEM5.IApplication.SetStatusBarText(System.String)
Sets a text on the status bar.
Text: Text to be shown on the status bar.